/*

Synchronous vs Asynchronous  

Synchronous:
একটি কোড ব্লক কম্পাইল না হওয়া পর্যন্ত
 পরবর্তী  কোডব্লকগুলোও কম্পাই হবে না। এই 
 কার্যক্রমকেই বলা হয় Synchronous ।  জাভাস্ক্রিপ্ট
  বাই ডিফল্ট একটি Synchronous প্রোগ্রামিং  
  ল্যাঙ্গুয়েজ । তাই এটি সিঙ্গেল থ্রেটেড। 
অর্থাৎ একটি কোডের কম্পাইলেশন  সম্পন্ন
হওয়ার পর পরবর্তী  কোডটি কম্পাইল হবে। 

Asynchronous:
ধরি আমরা একটি এপিআই কল করে কিছু ডাটা
ফেচ করতে চাচ্ছি কিন্তু ডাটা ফেচ হতে ৩ 
সেকেন্ড সময় লাগলো।তো এই ৩ সেকেন্ড বাকি কোড
কম্পাইল হবে না, ৩ সেকেন্ড পর ডাটা ফেচ হওয়ার পর হবে।
তো আমরা চাচ্ছি এ সময় টা বসে না থেকে কোড কম্পাইল করে
ফেলতে যেন কাজ সম্পন্ন করতে পারি আর এই জন্যই আমাদের
Asynchronous ব্যবহার করতে হবে।  

*/
